SPedt/src/Catalogs/Коробки/Коробки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Коробки</name>
  <predefined>
    <items>
      <name>БезКоробки</name>
      <description>Без коробки</description>
    </items>
  </predefined>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>КРазбору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаВТК</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтикера</name>
    <type>
      <types>EnumRef.ВидыСтикеров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГруппыДоставки</name>
    <type>
      <types>EnumRef.СтатусыГруппыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>EnumRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПредоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьВыбралУчастник</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВзвешивания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастникГД</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Взвешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлениеТранзита</name>
    <type>
      <types>DocumentRef.ОтправлениеТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаСкладе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоИсключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоУдалить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГруза</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСбора</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдачаТранзита</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОДоставке</name>
    <type>
      <types>DocumentRef.ОтчетОДоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРПОВыбралУчастник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеУдаления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Поступило</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SPedt/src/Documents/ЗапросыГруппДоставки/ЗапросыГруппДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросыГруппДоставки</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.ЗапросыГруппыДоставки</registerRecords>
  <attributes>
    <name>ОтправленныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапросыОтсрочки</name>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапросыИсключения</name>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеУдаления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапросыУдаления</name>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Пристрой</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеУдаления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапросыОплаты</name>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставкиПредоплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВзвешивания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетСтоимостиПоВсемТарифам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/Catalogs/Коробки/Forms/ФормаГруппыДоставки/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура ВесПриИзменении(Элемент)
	Объект.ДатаВзвешивания=ТекущаяДата();
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьАдрес(Команда)
	ПолучитьАдресНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьАдресНаСервере()
	ТЗ=Объект.Состав.Выгрузить(,"Покупка,Участник");
	СПЗаказыТК.ПолучитьАдресаНаТЗЗаказов(ТЗ)
КонецПроцедуры

&НаКлиенте
Процедура Взвесить(Команда)
	формаОтправления=ПолучитьФорму("Документ.ОтправлениеТранзита.Форма.ФормаДокумента",новый Структура("ГруппаДоставки,ТочкаНазначения",Объект.Ссылка,Объект.ТочкаНазначения));
	ДанныеФормы = формаОтправления.Объект;
	ВзвеситьНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, формаОтправления.Объект);
	формаОтправления.Открыть();
КонецПроцедуры

Процедура ВзвеситьНаСервере(ДанныеФормы)
	
	
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьССайта(Команда)
	ОбновитьССайтаНаСервере();
	Прочитать();
	ОбновитьОтображениеДанных();
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры

Процедура ОбновитьССайтаНаСервере()
	списокКодов = новый СписокЗначений;
	списокКодов.Добавить(Объект.Ссылка);
	СтоСПОбмен_ГруппыДоставки.Получить_ПоКодам(списокКодов);
КонецПроцедуры



&НаКлиенте
Процедура СоставУдалитьПриИзменении(Элемент)
	Элементы.Состав.ТекущиеДанные.Исключить = не Элементы.Состав.ТекущиеДанные.Удалить;
КонецПроцедуры

&НаКлиенте
Процедура СоставИсключитьПриИзменении(Элемент)
	Элементы.Состав.ТекущиеДанные.Удалить = не Элементы.Состав.ТекущиеДанные.Исключить;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчикаОбъект
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры


#Область УдалениеЗаказовИзГруппы
&НаКлиенте
Процедура УдалитьЗаказИзГруппы(Команда) 
	
	
	ОповещениеВопроса = Новый ОписаниеОповещения("УдалитьЗаказИзГруппыЗавершение",ЭтотОбъект);
	ПоказатьВопрос(ОповещениеВопроса,"Выделенные заказы будут удалены из группы. Продолжить?",РежимДиалогаВопрос.ДаНет);

	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаказИзГруппыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если результат = КодВозвратаДиалога.Да Тогда
		УдалитьЗаказИзГруппыНаСервере(Элементы.Состав.ВыделенныеСтроки);
		ОбновитьССайта(Неопределено);
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура УдалитьЗаказИзГруппыНаСервере(знач ВыделенныеСтроки)
	таблицаУдаления = Документы.ЗапросыГруппДоставки.ТаблицаУдаления();
	Для каждого элем из ВыделенныеСтроки цикл
		новаяСтрока = таблицаУдаления.добавить();
		новаяСтрока.ГруппаДоставки = объект.Ссылка;
		ЗаполнитьЗначенияСвойств(новаяСтрока, ОБъект.Состав.НайтиПоИдентификатору(элем));
	КонецЦикла;
	СтоСПОбмен_ГруппыДоставки.УдалитьЗаказы(таблицаУдаления);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияДоставки(Команда)
	текСтрока = объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ВыделенныеСтроки[0]);
	
	//текСтрока.Покупка
	Посылка = ПолучитьПосылкуПоКодузаказа(текСтрока.КодЗаказа);
	Если ЗначениеЗаполнено(Посылка) Тогда 
		открытьФорму(	"Отчет.ИсторияЗаказов.Форма.ФормаОтчета",
					новый структура("мегаордер, СформироватьПриОткрытии",Посылка.ШК, истина),
					ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не нойдена посылка по коду заказа");
	КонецЕсли;
КонецПроцедуры
				
Функция ПолучитьПосылкуПоКодузаказа(КодЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыВПосылках.Посылка КАК Посылка
		|ИЗ
		|	РегистрНакопления.ЗаказыВПосылках КАК ЗаказыВПосылках
		|ГДЕ
		|	ЗаказыВПосылках.КодЗаказа = &КодЗаказа
		|	И ЗаказыВПосылках.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("КодЗаказа", КодЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Посылка;	
	КонецЕсли;
	Возврат Неопределено;
КонецФункции	
				


//Процедура УдалитьДвижениеТовара(ПокупкиДляУдаления, УчастникДляУдаления, ПунктВыдачиГруппыДоставки)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ОстаткиТоваров.Регистратор
//		|ИЗ
//		|	РегистрНакопления.ОстаткиТоваров КАК ОстаткиТоваров
//		|ГДЕ
//		|	ОстаткиТоваров.Участник = &УчастникДляУдаления
//		|	И ОстаткиТоваров.Покупка.Покупка В (&ПокупкиДляУдаления)
//		|	И ТИПЗНАЧЕНИЯ(ОстаткиТоваров.Регистратор) = ТИП(Документ.Движение)
//		|	И ОстаткиТоваров.Регистратор.ТочкаНазначения = &ПунктВыдачиГруппыДоставки
//		|СГРУППИРОВАТЬ ПО
//		|	ОстаткиТоваров.Регистратор";
//	
//	Запрос.УстановитьПараметр("УчастникДляУдаления", УчастникДляУдаления);
//	Запрос.УстановитьПараметр("ПокупкиДляУдаления", ПокупкиДляУдаления);
//	Запрос.УстановитьПараметр("ПунктВыдачиГруппыДоставки", ПунктВыдачиГруппыДоставки);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		докДвижения	= Выборка.Регистратор.ПолучитьОбъект();
//		строкиДляУдаления	= новый Массив();
//		Для каждого элем из докДвижения.покупки Цикл
//			Если 	элем.Участник = УчастникДляУдаления и
//					ПокупкиДляУдаления.найти(элем.покупка.покупка)<>Неопределено Тогда
//				строкиДляУдаления.Добавить(элем);						
//			КонецЕсли;
//		КонецЦикла;
//		Для каждого заказ из строкиДляУдаления Цикл
//			докДвижения.покупки.Удалить(заказ);
//		КонецЦикла;
//			докДвижения.Записать(РежимЗаписиДокумента.Проведение)
//	КонецЦикла;
//	
//КонецПроцедуры

//Процедура УдалитьЗаказы(КодыЗаказаДляУдаления,УчастникДляУдаления, ГруппаДоставки)
//	
//	СтрокаПротокола						= 	новый Структура ("ДатаНачала, ДатаОкончания,Отправили, Результат, ПолученныеДанные");
//	СтрокаПротокола.Отправили			= 	ПолучитьТекстЗапросаУдаленияЗаказаИзГруппы(КодыЗаказаДляУдаления,УчастникДляУдаления, ГруппаДоставки);
//	СтрокаПротокола.ДатаНачала			=	ТекущаяДата();

//	Параметры    						= новый Структура;
//	АдресСкрипта 						= Константы.АдресВыгрузкиНасайт.Получить();
//	Параметры.Вставить("token",	Константы.Токен.Получить());
//	Параметры.Вставить("xml", 	СтрокаПротокола.Отправили);

//	ПолученныйФайл						= СтоСПОбмен_Общий.ПолучитьПостЗапросом(Параметры,АдресСкрипта);
//	
//	Если ПолученныйФайл=Неопределено Тогда 		
//		СтрокаПротокола.Результат		= "Не удалось соеденится с сайтом"; 
//		СтрокаПротокола.ДатаОкончания	= ТекущаяДата();
//		Возврат;	
//	КонецЕсли; 
//	Если аспПроцедурыОбменаДанными.АвторизацияВыполнена(ПолученныйФайл) Тогда
//		СтрокаПротокола.Результат="Авторизация выполнена";
//	Иначе
//		СтрокаПротокола.Результат="Авторизация не выполнена";
//	КонецЕсли;	
//	
//	СтрокаПротокола.ПолученныеДанные	= СтоСПОбмен_Общий.ФайлВСтроку(ПолученныйФайл);
//	СтрокаПротокола.ДатаОкончания		= ТекущаяДата();
//	//СтоСПОбмен_Выгрузка100сп.СохранитьПротоколОбмена(СтрокаПротокола,ДокументПротокола);
//	
//КонецПроцедуры

//функция   ПолучитьТекстЗапросаУдаленияЗаказаИзГруппы(КодыЗаказаДляУдаления,УчастникДляУдаления, ГруппаДоставки)
//	 ЗаписьXML=новый ЗаписьXML;
//	 ЗаписьXML.УстановитьСтроку("UTF-8");
//	 ЗаписьXML.ЗаписатьНачалоЭлемента("distributors");
//	 
//	 ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi","http://www.w3.org/2001/XMLSchema-instance");
//	 ЗаписьXML.ЗаписатьАтрибут("xmlns:xsd","http://www.w3.org/2001/XMLSchema");
//	 	
//	 Для каждого стр из КодыЗаказаДляУдаления Цикл 
//		 ЗаписьXML.ЗаписатьНачалоЭлемента("groupsUnlink");
//			 ЗаписьXML.ЗаписатьНачалоЭлемента("group");
//			 
//					 ЗаписьXML.ЗаписатьНачалоЭлемента("delivery_group_id");
//					 	ЗаписьXML.ЗаписатьТекст(Формат(Число(СтрЗаменить(ГруппаДоставки.Код,"гд_","")),"ЧГ=0"));
//					 ЗаписьXML.ЗаписатьКонецЭлемента();
//					 
//					 ЗаписьXML.ЗаписатьНачалоЭлемента("orderType");
//					 	ЗаписьXML.ЗаписатьТекст("sp");
//					 ЗаписьXML.ЗаписатьКонецЭлемента();
//					 

//						 ЗаписьXML.ЗаписатьНачалоЭлемента("orderId");
//						 ЗаписьXML.ЗаписатьТекст(Формат(стр,"ЧГ=0"));
//						 ЗаписьXML.ЗаписатьКонецЭлемента();
//					 
//					 ЗаписьXML.ЗаписатьНачалоЭлемента("uid");
//					 	ЗаписьXML.ЗаписатьТекст(Формат(УчастникДляУдаления.Код,"ЧГ=0"));
//					 ЗаписьXML.ЗаписатьКонецЭлемента();
//					 
//					 
//			 
//			 ЗаписьXML.ЗаписатьКонецЭлемента();
//		 ЗаписьXML.ЗаписатьКонецЭлемента();		 
//		 
//	КонецЦикла;	
//	 ЗаписьXML.ЗаписатьКонецЭлемента();	
//	 
//	ОтправленныеДанные = ЗаписьXML.Закрыть();	
//	ОтправленныеДанные = СтрЗаменить(ОтправленныеДанные,"xmlns=""http://www.100sp.ru/XMLSchema-instance"" ","");
//	Возврат ОтправленныеДанные;
//КонецФункции	

//	
#КонецОбласти
